const 版本 = 1;
const 提款 = {
    看电视: {
        name: '看电视',
        预留存款: 3600,
        // 最长时间: 3600,
        元素: ['提款_看电视' //
        ],
        版本: 1001,
    },
    玩手机: {
        name: '玩手机,ipad',
        预留存款: 1800,
        // 最长时间: 1800,
        元素: ['提款_玩手机' //
        ],
        版本: 1001,
    },
    临时: {
        name: '临时提款( 1小时 )',
        预留存款: 600,
        // 最长时间: 3600,
        元素: ['提款_临时' //
        ],
        版本: 1001,
    },
};
// 
const 任务 = {
    起床: {
        name: '起床',
        元素: ['a4起床' //
            , 'a4刷牙' //
            , 'a4洗脸' //
            , 'a4吃早餐_喝水' //
            , 'a4换衣服鞋子' //
        ],
        启动时间段: '6:30',
        条件: {
            存款: 1200, // 20分钟
        }
    },
    中饭: {
        name: '吃中饭',
        元素: ['a4中饭' //
        ],
        启动时间段: '12:00',
        条件: {}
    },
    晚饭: {
        name: '吃晚饭',
        元素: ['a4晚饭' //
        ],
        启动时间段: '19:00',
        条件: {}
    },
    洗澡: {
        name: '洗澡',
        元素: ['a4洗澡准备' //
            , 'a4洗澡'
        ],
        启动时间段: '21:00',
        条件: {
            存款: 1200, // 20分钟
        }
    },
    刷牙睡觉: {
        name: '刷牙睡觉',
        元素: ['a4准备刷牙_晚上' //
            , 'a4刷牙' //
            , 'a4洗脸'
        ],
        启动时间段: '21:30',
        条件: {
            存款: 600, // 10分钟
        }
    },
    临时: {
        name: '临时剧本',
        元素: ['临时x' //
        ],
    },
};
// 
const 元素 = {
    临时x: {
        nextKey: '临时任务',
        时长: 60, // 时长不定 , 临时设 60 秒
        声音: {
            // 0: {
            //     key: '自定义元素',
            //     fun: ['输入时间长度' //
            //         , '报时语音组' //
            //     ],
            // },
            10: {
                key: '不限句数',
                arr: ['最后5分钟' // 
                    , '每5分钟' // 
                    , '最后1分钟' // 
                ],
            },
        },
    },
    // --------------------
    // --------------------
    // 提款 . 开始,提醒家长带上手机
    提款_看电视: {
        nextKey: '--',
        时长: 3600, //3600 秒 // 1小时
        声音: {
            10: {
                key: '不限句数',
                arr: ['最后5分钟' // 
                    , '最后1分钟' // 
                    , '提款_家长要带上手机' // 
                ],
            },
        },
    },
    // 
    提款_玩手机: {
        nextKey: '--',
        时长: 1800, //1200 秒 // 20分钟
        声音: {
            10: {
                key: '不限句数',
                arr: ['最后5分钟' // 
                    , '最后1分钟' // 
                    , '提款_家长要带上手机' // 
                ],
            },
        },
    },
    // 
    提款_临时: {
        nextKey: '--',
        时长: 3600, // 1小时
        声音: {
            10: {
                key: '不限句数',
                arr: ['每5分钟' // 
                    , '提款_家长要带上手机' // 
                ],
            },
        },
    },
    // --------------------
    // --------------------
    // 起床
    // 
    a4起床: {
        nextKey: '起床',
        时长: 300, // 5分钟
        声音: {
            0: {
                key: '不限句数',
                arr: ['最后30秒' // 
                    , '最后1分钟' // 
                ],
            },
            1: {
                key: '最少一句',
                arr: ['起床了'],
            },
            15: {
                key: '最多一句',
                arr: ['早上事情特别多' //
                    , '赶紧上个厕所_准备刷牙'
                ],
            },
            60: {
                key: '最多一句',
                arr: ['准备好就开始刷牙'],
            },
        },
    }, // 起床
    // 
    a4刷牙: {
        nextKey: '刷牙洗脸 [开始]',
        时长: 240, // 4分钟
        声音: {
            0: {
                key: '不限句数',
                arr: ['最后30秒' //
                    , '每1分钟' // 
                ],
            },
            2: {
                key: '禁止提前',
            },
            30: {
                key: '最多一句',
                arr: ['刷牙注意' // 
                    , '刷牙闲聊' // 
                ],
            },
            75: {
                key: '最多一句',
                arr: ['存款的规则1' // 
                ],
            },
            180: {
                key: '最多一句',
                arr: ['刷牙时间够了' // 
                ],
            },
        },
    }, // 刷牙
    // 
    a4洗脸: {
        nextKey: '洗脸',
        时长: 120, // 2分钟
        声音: {
            0: {
                key: '不限句数',
                arr: ['最后30秒' //
                    , '最后1分钟' // 
                ],
            },
            45: {
                key: '最多一句',
                arr: ['一次洗不干净' //
                    , '毛巾要拧干' // 
                ],
            },
        },
    }, // 洗脸
    // 
    a4吃早餐_喝水: {
        nextKey: '吃早餐',
        时长: 900, // 15 分钟
        声音: {
            0: {
                key: '不限句数',
                arr: ['最后1分钟' // 
                    , '时间过了一半', '最后3分钟' // 
                    , '最后5分钟' // 
                    , '每1分钟'
                ],
            },
            5: {
                key: '最多一句',
                arr: ['早餐开始', '抓紧时间吃早餐' // 
                    , '早餐的重要性' // 
                ],
            },
            60: {
                key: '最少一句',
                arr: ['早上喝水'],
            },
            180: { // 3分钟
                key: '最多一句',
                arr: ['早餐闲聊' //
                    , '存款的规则1' // 
                ],
            },
        },
        中断权: ['a4拉臭臭' //
            , 'a4拉嘘嘘'
        ],
    }, // a4吃早餐_喝水
    // 
    a4换衣服鞋子: {
        nextKey: '换衣服',
        时长: 480, // 8 分钟
        声音: {
            0: {
                key: '不限句数',
                arr: ['最后1分钟' // 
                    , '时间过了一半' //
                    , '最后3分钟' // 
                    , '最后5分钟' // 
                    , '每1分钟'
                ],
            },
            60: { // 3分钟
                key: '最多一句',
                arr: ['换衣服鞋子'],
            },
        },
    }, //a4换衣服鞋子
    // 
    // --------------------
    // --------------------
    // 中饭
    // 
    a4中饭: {
        nextKey: '开始吃饭',
        时长: 1500, // 25 分钟
        声音: {
            0: {
                key: '不限句数',
                arr: ['最后30秒' //
                    , '最后1分钟' // 
                    , '时间过了一半' //
                    , '最后3分钟' // 
                    , '最后5分钟' //
                    , '还剩10分钟' // 
                    , '每1分钟' //
                    , '每5分钟'
                ],
            },
            5: {
                key: '最多一句',
                arr: ['吃饭开始'],
            },
            180: { // 3分钟
                key: '最多一句',
                arr: ['饭前定量' //
                    , '其他吃饭建议'
                ],
            },
            800: { // 约13分钟
                key: '最多一句',
                arr: ['饭间闲聊' //
                    , '存款的规则1'
                ],
            },
        },
        中断权: ['a4拉臭臭' //
            , 'a4拉嘘嘘'
        ],
    },
    a4晚饭: {
        nextKey: '开始吃饭',
        时长: 1500, // 25 分钟
        声音: {
            0: {
                key: '不限句数',
                arr: ['最后30秒' //
                    , '最后1分钟' // 
                    , '时间过了一半' //
                    , '最后3分钟' // 
                    , '最后5分钟' //
                    , '还剩10分钟' // 
                    , '每1分钟' //
                    , '每5分钟'
                ],
            },
            5: {
                key: '最多一句',
                arr: ['吃饭开始'],
            },
            180: { // 3分钟
                key: '最多一句',
                arr: ['饭前定量', '其他吃饭建议'],
            },
            800: { // 约13分钟
                key: '最多一句',
                arr: ['饭间闲聊' //
                    , '存款的规则1'
                ],
            },
        },
        中断权: ['a4拉臭臭' //
            , 'a4拉嘘嘘'
        ],
    },
    // --------------------
    // --------------------
    // 洗澡
    // 
    a4洗澡准备: {
        nextKey: '准备洗澡',
        时长: 120, // 2分钟 
        声音: {
            0: {
                key: '不限句数',
                arr: ['最后30秒' //
                    , '最后1分钟' // 
                ],
            },
            5: {
                key: '最多一句',
                arr: ['洗澡准备' //
                ],
            },
        },
        提前: ['提前'],
        延迟: ['延迟'],
    },
    a4洗澡: {
        nextKey: '洗澡 [开始]',
        时长: 900, // 15分钟
        中断权: ['a4拉臭臭'],
        声音: {
            0: {
                key: '不限句数',
                arr: ['最后5分钟' // 
                    , '每5分钟' // 
                    , '最后1分钟' // 
                ],
            },
        },
        提前: ['提前'],
        延迟: ['延迟'],
    },
    // --------------------
    // --------------------
    // 
    // 刷牙睡觉
    // 
    a4准备刷牙_晚上: {
        nextKey: '准备刷牙',
        时长: 90,
        声音: {
            0: {
                key: '不限句数',
                arr: ['最后30秒' //
                    , '最后1分钟' // 
                ],
            },
            5: {
                key: '最多一句',
                arr: ['刷牙准备' // 
                ],
            },
        },
    },
};
const 元素插入 = {
    a4拉臭臭: {
        时长: 600,
        开始音: ['拉臭臭开始'],
        间隔: 5400, // 90分钟
    },
    a4拉嘘嘘: {
        时长: 120,
        开始音: ['拉嘘嘘开始'],
        间隔: 1800, // 30分钟
    },
    a4喝水: {
        时长: 90,
        开始音: ['喝水开始'],
        间隔: 1800, // 30分钟
    },
};
// 
const 声音 = {
    '提款_家长要带上手机': {
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['提款提醒1' //
            , '提款提醒2' //
            , '提款提醒3' //
        ],
        版本: '1',
    },
    // 
    // --------------------
    // --------------------
    // 
    // 
    '最后30秒': {
        exec: [{
            fun: '元素时长大于',
            dat: {
                时长: 50, // 
            },
        }, {
            fun: '倒设_时刻',
            dat: {
                时刻: 30, // 
            }
        }],
        URLs: ['最后30秒1' //
            , '最后30秒2' //
            , '最后30秒3' //
            , '最后30秒4' //
            , '最后30秒5' //
        ],
        版本: '1',
    },
    '最后1分钟': {
        exec: [{
            fun: '元素时长大于',
            dat: {
                时长: 150, // 
            },
        }, {
            fun: '倒设_时刻',
            dat: {
                时刻: 60, // 
            }
        }],
        URLs: ['最后1分钟1' //
            , '最后1分钟2' //
            , '最后1分钟3' //
            , '最后1分钟4' //
        ],
        版本: '1',
    },
    '时间过了一半': {
        exec: [{
            fun: '元素时长大于',
            dat: {
                时长: 50, // 
            },
        }, {
            fun: '设置_时刻_一半',
        }],
        URLs: ['时间过一半1' //
            , '时间过一半2' //
            , '时间过一半3' //
        ],
        版本: '1',
    },
    '最后3分钟': {
        exec: [{
            fun: '元素时长大于',
            dat: {
                时长: 300, // 5分钟
            },
        }, {
            fun: '倒设_时刻',
            dat: {
                时刻: 180, // 
            }
        }],
        URLs: ['最后3分钟1' //
            , '最后3分钟2' //
            , '最后3分钟3' //
            , '最后3分钟4' //
            , '最后3分钟5' //
            , '最后3分钟6' //
        ],
        版本: '1',
    },
    '最后5分钟': {
        exec: [{
            fun: '元素时长大于',
            dat: {
                时长: 480, // 8 分钟
            },
        }, {
            fun: '倒设_时刻',
            dat: {
                时刻: 300, // 
            }
        }],
        URLs: ['最后5分钟1' //
            , '最后5分钟2' //
            , '最后5分钟3' //
        ],
        版本: '1',
    },
    '还剩10分钟': {
        exec: [{
            fun: '元素时长大于',
            dat: {
                时长: 720, //  12 分钟
            },
        }, {
            fun: '倒设_时刻',
            dat: {
                时刻: 600, // 
            }
        }],
        URLs: ['最后10分钟1' //
            , '最后10分钟2' //
            , '最后10分钟3' //
            , '最后10分钟4' //
            , '最后10分钟5' //
            , '最后10分钟6' //
            , '最后10分钟7' //
            , '最后10分钟8' //
            , '最后10分钟9' //
            , '最后10分钟10' //
        ],
        版本: '1',
    },
    '每1分钟': {
        exec: [{
            fun: '元素时长大于',
            dat: {
                时长: 120, //  2 分钟
            },
        }, {
            fun: '时刻循环',
            dat: {
                间距: 60, // 秒
                结尾留空: 90, // 最后90秒 不报时
            }
        }],
        URLs: ['过去了1分钟1' //
            , '过去了1分钟2' //
            , '过去了1分钟3' //
            , '过去了1分钟4' //
            , '过去了1分钟5' //
        ],
        版本: '1',
    },
    '每5分钟': {
        exec: [{
            fun: '元素时长大于',
            dat: {
                时长: 600, //  10 分钟
            },
        }, {
            fun: '时刻循环',
            dat: {
                间距: 300, // 秒
                结尾留空: 150,
            }
        }],
        URLs: ['过去了5分钟1' //
            , '过去了5分钟2' //
            , '过去了5分钟3' //
            , '过去了5分钟4' //
            , '过去了5分钟5' //
            , '过去了5分钟6' //
        ],
        版本: '1',
    },
    // 
    // 报时
    // =====================
    // 
    '起床了': {
        // 样板 :
        // 
        // 起床了
        // 起床喏,起床喏,起床喏
        // 不要再睡了 
        // 
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['起床了' //
            , '起床了2' //
            , '起床了3' //
            , '起床了4' //
            , '起床了别睡了' //
            , '起床了5' //
            , '起床了6' //
        ],
        //
        顺序: '循环',
    },
    '赶紧上个厕所_准备刷牙': {
        // 样板 :
        // 赶紧上个厕所_准备刷牙
        // 其他别做_上完厕所准备刷牙吧
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['早上上厕所1' //
            , '早上上厕所2' //
            , '早上上厕所3' //
            , '早上上厕所6' //
        ],
        版本: '1',
    },
    '早上事情特别多': {
        // 样板 :
        // 早上事情特别多
        // 小朋友 , 打起精神
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['早上事情特别多1' //
            , '早上事情特别多2' //
            , '早上事情特别多3' //
        ],
        版本: '1',
    },
    '准备好就开始刷牙': {
        // 样板 :
        // 牙膏挤好了吗, 可以了就按下一步
        // 准备好就按下一步
        // '准备好就开始刷牙_记得按下一步'
        // 
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['刷牙准备1' //
            , '刷牙准备2' //
        ],
        版本: '1',
    },
    '刷牙注意': {
        // 样板 :
        // 要上下来回刷
        // 牙齿内侧也要刷
        // 刷牙_保证3分钟
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['刷牙注意1' //
            , '刷牙注意2' //
            , '刷牙注意3' //
            , '刷牙注意5' //
            , '刷牙注意6' //
            , '刷牙注意8' //
        ],
        版本: '1',
    },
    '刷牙闲聊': {
        // 样板 :
        // 不要刷着刷着刷着睡着了
        // 曾经有小朋友刷牙睡着了
        // 我喜欢橙子味的牙膏
        // 
        // 从前有个小朋友每天起来都刷牙
        // 有一天呢,他一边刷牙一边点头,
        // 一边刷牙一边点头,
        // 妈妈看了,觉得很奇怪,过去一看
        // 嗨 ,睡着了
        // 
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['刷牙闲聊1' //
            , '刷牙闲聊2' //
            , '刷牙闲聊3' //
            , '刷牙闲聊4' //
            , '刷牙闲聊8' //
        ],
        版本: '1',
    },
    '刷牙时间够了': {
        // 样板 :
        // 刷牙3分钟够了 , 准备洗脸
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['刷牙结束1' //
            , '刷牙结束2' //
            , '刷牙结束3' //
        ],
        版本: '1',
    },
    '一次洗不干净': { // 洗脸
        // 样板 :
        // 一次洗不干净
        // 洗脸最少要洗两次
        // 
        // 
        // 
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['洗脸要两次1' //
            , '洗脸要两次2' //
            , '洗脸要两次3' //
            , '洗脸要两次4' //
        ],
        版本: '1',
    },
    '毛巾要拧干': { // 洗脸
        // 样板 :
        // 毛巾要拧干
        // 看看毛巾有没有滴水
        // 毛巾不拧干会发霉
        // 
        // 
        // 
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['毛巾要拧干1' //
            , '毛巾要拧干2' //
            , '毛巾要拧干3' //
            , '毛巾要拧干4' //
            , '毛巾要拧干6' //
            , '毛巾要拧干7' //
        ],
        版本: '1',
    },
    '早餐开始': { //
        // 样板 :
        // 早餐开始
        // 开始吃早餐了
        // 
        // 
        // 
        // 
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['早餐开始1' //
            , '早餐开始2' //
            , '早餐开始3' //
            , '早餐开始4' //
            , '早餐开始5' //
        ],
        版本: '1',
    },
    '抓紧时间吃早餐': { //
        // 样板 :
        // 
        // 抓紧时间吃早餐
        // 
        // 
        // 
        // 
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['早餐时间1' //
            , '早餐时间2' //
            , '早餐时间3' //
        ],
        版本: '1',
    },
    '早餐的重要性': { //
        // 样板 :
        // 
        // 仔细体会食物的味道
        // 
        // 
        // 
        // 
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['早餐重要1' //
            , '早餐重要2' //
            , '早餐重要3' //
        ],
        版本: '1',
    },
    '早上喝水': { //
        // 样板 :
        // 
        // 早上喝水很重要
        // 一定要喝水
        // 喝水最好, 喝牛奶,果汁 也行
        // 
        // 
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['早上喝水1' //
            , '早上喝水2' //
            , '早上喝水3' //
            , '早上喝水4' //
            , '早上喝水5' //
        ],
        版本: '1',
    },
    '早餐闲聊': { //
        // 样板 :
        // 
        // 早餐你最喜欢什么
        // 明天早晨你想吃什么
        // 是谁做早餐
        // 
        // 
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['早餐闲聊1' //
            , '早餐闲聊2' //
            , '早餐闲聊3' //
            , '早餐闲聊4' //
            , '早餐闲聊5' //
            , '早餐闲聊6' //
            , '早餐闲聊7' //
        ],
        版本: '1',
    },
    '换衣服鞋子': { //
        // 样板 :
        // 
        // 换完衣服来按下一步
        // 如果东西太多,就列一张清单
        // 衣服,鞋子,书包
        // 换衣服不要带手机
        // 最近几天下雨吗
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['早上换衣服1' //
            , '早上换衣服2' //
            , '早上换衣服4' //
        ],
        版本: '1',
    },
    // --------------------
    // --------------------
    // 吃饭
    // 
    '吃饭开始': { //
        // 样板 :
        // 
        // 开始吃饭啦
        // 开始吃饭啦_肯德基版
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['吃饭开始1' //
            , '吃饭开始2' //
            , '吃饭开始3' //
        ],
        版本: '1',
    },
    // 
    '饭前定量': { //
        // 样板 :
        // 
        // 饭前定量
        // 定量,避免父母随意添加
        // 
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['饭前定量' //
            , '饭前定量1' //
            , '饭前定量2' //
        ],
        版本: '1',
    },
    // 
    '其他吃饭建议': { //
        // 样板 :
        //  // 上饭了才开始计时
        // 如果在外面吃饭该怎样控制时间
        // 吃饭时不要评价小朋友
        // 
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['吃饭建议1' //
            , '吃饭建议2' //
            , '吃饭建议3' //
        ],
        版本: '1',
    },
    // 
    '饭间闲聊': { //
        // 样板 :
        // 
        // 今天菜不错
        // 咳嗽,少吃点煎炸
        // 要多吃青菜 
        // 你想学做菜吗
        // 吃饭不要翘板凳
        // 听过别人吧唧嘴吗
        // 烧菜挺辛苦
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['吃饭闲聊1' //
            , '吃饭闲聊2' //
            , '吃饭闲聊3' //
            , '吃饭闲聊4' //
            , '吃饭闲聊5' //
        ],
        版本: '1',
    },
    // 
    '刷牙准备': { //
        // 样板 :
        // 刷牙准备_1
        // 刷牙准备_2
        // 
        // 
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['准备刷牙1' //
            , '准备刷牙2' //
            , '准备刷牙3' //
        ],
        版本: '1',
    },
    // 
    '存款的规则1': { //
        // 样板 :
        // 
        // 时间存款有利息
        // 节约的时间存入银行账户
        // 时间存款可以用来看电视,玩ipad
        // 时间存款不足,不能看电视
        // 存款不够10分钟 , 不能提款
        // 为什么要预留存款
        // 剩下的时间是存款
        // 
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['规则1' //
            , '规则2' //
            , '规则3' //
            , '规则4' //
        ],
        版本: '1',
    },
    // 
    '洗澡准备': { //
        // 样板 :
        // 
        // 衣服 , 毛巾 , 都要拿齐啦
        // 
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['准备洗澡1' //
            , '准备洗澡2' //
        ],
        版本: '1',
    },
    // 
    '延迟': { //
        // 样板 :
        // 加油
        // 别急,集中精神搞定他
        // 没问题,你可以的
        // 浪费一点存款不算什么,加油
        // 加油呀,正在扣存款啊
        // 这次要扣点存款了
        // 
        exec: [{
            fun: '几率_一定播放',
        }],
        URLs: ['abc1', 'abc2', 'abc3', 'abc4'],
        版本: '1',
    },
    // 
    '存款不够10分钟': {
        // 你的存款不够10分钟 ,
        // 不能提取
        exec: [{
            fun: '几率_一定播放',
        }, {
            fun: '后续声音',
            dat: {
                间隔: 15, // 开始后15秒 , 立即播放
                声音: '为什么要预留存款',
            }
        }],
        URLs: ['abc1', 'abc2', 'abc3', 'abc4'],
        版本: '1',
    },
    '为什么要预留存款': {
        // 为什么要帮你预留存款时间呢?
        // 因为万一吃饭超时了 , 
        // 需要用存款时间来填补
        exec: [{
            fun: '几率_调用次数',
            dat: {
                1: 100, // 第一次调用 , 100%播放
                2: 50, // 第二次及以后调用 , 50%播放 , 
            },
        }, {
            fun: '几率_播放次数控制',
            dat: {
                每: 15, // 每调用 15次
                播: 3, // 播放不超过3次
            }
        }],
        URLs: ['abc1', 'abc2', 'abc3', 'abc4'],
        版本: '1',
    },
};
//
//
const cs_dat_file_js = {
    // 提款: 提款,
    // 任务: 任务,
    // 元素: 元素,
    // 元素插入: 元素插入,
    // 声音: 声音,
    //
    // 
    更新: function() {
        var A = getApp();
        // var s = 'CS版本';
        // var v = A.DAT.get_SYS(s);
        // if (v == 版本) return;
        // 
        A.SYS.Each(声音, A.SOUND.初始化);
        A.SYS.Each(元素, A.ELEMENT.初始化);
        A.SYS.Each(任务, A.MISSION.初始化);
        A.SYS.Each(提款, A.TAKEBACK.初始化);
        // 
        A.MISSION.保存列表();
        A.TAKEBACK.保存列表();
        // 
        // A.DAT.set_SYS(s, 版本);
    }
};
module.exports = cs_dat_file_js;