t = {
    "OPT": {
        "call": ["登录OK"]
    },
    "DAT": [{
        "name": "projoct",
        "arr": [{
            "JID": "118",
            "FT": "2018-05-10 16:21:34",
            "name": "测试项目1",
            "JSON": {
                "监理": {
                    "name": "监理单位"
                },
                "甲方": {
                    "name": "甲方单位"
                },
                "施工": {
                    "name": "施工单位"
                },
                "临时": {
                    "name": "相关单位"
                }
            }
        }, {
            "JID": "119",
            "FT": "2018-05-10 16:21:34",
            "name": "测试项目2",
            "JSON": {
                "监理": {
                    "name": "监理单位"
                },
                "甲方": {
                    "name": "甲方单位"
                },
                "施工": {
                    "name": "施工单位"
                },
                "临时": {
                    "name": "相关单位"
                }
            }
        }]
    }, {
        "name": "pro_user",
        "arr": [{
            "JID": "118",
            "GRO": "监理",
            "UID": "74",
            "FT": "2018-05-10 16:49:07",
            "JSON": {
                "name": "飞机场",
                "inUser": "73",
                "role": ["监理浏览"]
            }
        }, {
            "JID": "119",
            "GRO": "甲方",
            "UID": "74",
            "FT": "2018-05-10 16:52:59",
            "JSON": {
                "name": "飞机场",
                "inUser": "73",
                "role": ["甲方巡查"]
            }
        }]
    }, {
        "name": "work",
        "arr": []
    }, {
        "name": "user_my",
        "arr": [{
            "UID": "74",
            "name": "飞机场",
            "FT": "2018-05-10 16:52:59",
            "LT": "2018-05-10 16:49:07",
            "JSON": {
                "JID": "119",
                "分组": "甲方"
            }
        }]
    }]
}